In [207]:
import pandas as pd

In [208]:
df_chamber = pd.read_csv("./data/Chamber/clean_deputies.xz",compression='xz',low_memory=False)

**Pegando soma, média e máximo por ano:**

In [209]:
df_chamber.groupby("year")['document_value'].agg(['sum', 'mean', 'max'])

               sum        mean       max
year
2009  9.280041e+07  539.719295  122850.0
2010  1.227308e+08  600.741115  141000.0
2011  1.270438e+08  595.390144  197000.0
2012  1.254368e+08  636.673372  215000.0
2013  1.322538e+08  681.169332  197370.0
2014  1.425243e+08  827.936564  208320.0
2015  1.581929e+08  757.886380  189600.0
2016  1.671565e+08  831.533252  184500.0
2017  1.238131e+08  820.182399   79900.0

**Vamos também descobrir soma, média e máximo totais:**

In [210]:
df_chamber['document_value'].agg(['sum', 'mean', 'max'])

sum     1.191952e+09
mean    6.955638e+02
max     2.150000e+05
Name: document_value, dtype: float64

**Agora vamos descobrir quem são os responsáveis pelo maior gasto em cada ano:**

In [249]:
df_cp_year = df_chamber.groupby(["congressperson_name", "year"])['document_value'].agg(['sum', 'mean', 'max']).reset_index()

In [256]:
sum_years = df_cp_year.groupby("year")['sum'].max()

In [257]:
sum_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['sum'] == sum_years[2009])]
sum_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['sum'] == sum_years[2010])]
sum_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['sum'] == sum_years[2011])]
sum_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['sum'] == sum_years[2012])]
sum_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['sum'] == sum_years[2013])]
sum_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['sum'] == sum_years[2014])]
sum_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['sum'] == sum_years[2015])]
sum_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['sum'] == sum_years[2016])]
sum_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['sum'] == sum_years[2017])]

In [258]:
sum_2009

     congressperson_name  year        sum          mean      max
5245  WELLINGTON ROBERTO  2009  344510.25  13250.394231  71400.0

In [259]:
sum_2010

     congressperson_name  year        sum         mean      max
4967        URZENI ROCHA  2010  383158.94  3115.113333  23000.0

In [260]:
sum_2011

     congressperson_name  year        sum          mean      max
5247  WELLINGTON ROBERTO  2011  400055.78  12905.025161  84500.0

In [261]:
sum_2012

     congressperson_name  year        sum         mean      max
5401      ÂNGELO AGNOLIN  2012  394079.57  3311.593025  50000.0

In [262]:
sum_2013

     congressperson_name  year        sum         mean      max
4291           RAUL LIMA  2013  418348.99  6536.702969  23500.0

In [263]:
sum_2014

     congressperson_name  year       sum          mean      max
4292           RAUL LIMA  2014  485568.1  17341.717857  55000.0

In [264]:
sum_2015

     congressperson_name  year        sum        mean      max
3398      MARCOS ROGÉRIO  2015  518064.65  841.014042  26770.0

In [265]:
sum_2016

     congressperson_name  year        sum         mean      max
1518     ELIZEU DIONIZIO  2016  505356.39  2168.911545  10000.0

In [266]:
sum_2017

     congressperson_name  year        sum        mean      max
3400      MARCOS ROGÉRIO  2017  402849.36  1224.46614  30000.0

**Vamos descobrir agora quem são os reponsáveis pelos maiores gastos na média em cada ano:**

In [223]:
mean_max_year = df_cp_year.groupby("year")['mean'].max()

In [224]:
mean_max_year

year
2009     17700.000000
2010     33184.323333
2011     28952.000000
2012     20161.111111
2013     47200.000000
2014     62325.000000
2015    109810.000000
2016     19044.845385
2017     18960.417647
Name: mean, dtype: float64

In [225]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_max_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_max_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_max_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_max_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_max_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_max_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_max_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_max_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_max_year[2017])]

In [226]:
mean_2009

   congressperson_name  year      sum     mean      max
54         ADÃO PRETTO  2009  17700.0  17700.0  17700.0

In [227]:
mean_2010

     congressperson_name  year        sum          mean      max
4771        SILAS CÂMARA  2010  298658.91  33184.323333  93000.0

In [228]:
mean_2011

      congressperson_name  year      sum     mean      max
1676  FERNANDO DE FABINHO  2011  28952.0  28952.0  28952.0

In [229]:
mean_2012

     congressperson_name  year       sum          mean      max
5248  WELLINGTON ROBERTO  2012  362900.0  20161.111111  80000.0

In [230]:
mean_2013

        congressperson_name  year       sum     mean      max
4658  SABINO CASTELO BRANCO  2013  330400.0  47200.0  80000.0

In [231]:
mean_2014

        congressperson_name  year       sum     mean       max
4659  SABINO CASTELO BRANCO  2014  373950.0  62325.0  184500.0

In [232]:
mean_2015

     congressperson_name  year       sum      mean       max
472  ARNALDO FARIA DE SÁ  2015  219620.0  109810.0  189600.0

In [233]:
mean_2016

     congressperson_name  year        sum          mean      max
5297      WLADIMIR COSTA  2016  247582.99  19044.845385  72200.0

In [234]:
mean_2017

     congressperson_name  year       sum          mean      max
4778        SILAS CÂMARA  2017  322327.1  18960.417647  37578.6

**Agora vejamos quem são deputados com menores gastos médios:**

In [235]:
mean_min_year = df_cp_year.groupby("year")['mean'].min()

In [236]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_min_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_min_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_min_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_min_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_min_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_min_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_min_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_min_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_min_year[2017])]

In [237]:
mean_2009

     congressperson_name  year      sum       mean    max
4475           RODOVALHO  2009  7545.21  40.565645  160.0

In [238]:
mean_2010

      congressperson_name  year        sum       mean     max
2386  JORGE TADEU MUDALEN  2010  128170.67  78.152848  4900.0

In [239]:
mean_2011

    congressperson_name  year      sum      mean     max
910    CELSO RUSSOMANNO  2011  2672.02  65.17122  295.84

In [240]:
mean_2012

     congressperson_name  year    sum   mean    max
2148      HUMBERTO SOUTO  2012  250.2  62.55  103.4

In [241]:
mean_2013

     congressperson_name  year       sum       mean      max
3240    MANUEL ROSA NECA  2013  23099.08  86.838647  1545.07

In [242]:
mean_2014

      congressperson_name  year        sum       mean     max
2390  JORGE TADEU MUDALEN  2014  142048.45  86.142177  3000.0

In [243]:
mean_2015

     congressperson_name  year    sum       mean   max
3170        LÉO OLIVEIRA  2015  115.0  38.333333  50.0

In [244]:
mean_2016

     congressperson_name  year      sum       mean     max
3774    NILMÁRIO MIRANDA  2016  1370.71  91.380667  787.35

In [245]:
mean_2017

      congressperson_name  year        sum       mean      max
2393  JORGE TADEU MUDALEN  2017  144055.37  98.871222  16000.0

**Agora analizemos por partido**

In [304]:
df_party_year = df_chamber.groupby(["party", "year"])['document_value'].agg(['sum', 'mean', 'max']).reset_index()
df_party_year

       party  year          sum         mean        max
0     AVANTE  2009    296591.11  4493.804697   74000.00
1     AVANTE  2010    455301.65  3118.504452   35000.00
2     AVANTE  2011    964038.73  1157.309400   25000.00
3     AVANTE  2012    891735.40  1231.678729   37380.00
4     AVANTE  2013    922442.55  1740.457642   35000.00
5     AVANTE  2014   1047439.08  2297.015526   58500.00
6     AVANTE  2015   1467553.38  1392.365636   29780.00
7     AVANTE  2016   1455524.13  1024.295658   49500.00
8     AVANTE  2017   1231205.08  1042.510652   40000.00
9        DEM  2009   7090403.44   624.045365   80000.00
10       DEM  2010  10190775.06   678.977617  120175.00
11       DEM  2011   7923830.90   572.572505   61873.00
12       DEM  2012   8090979.16   647.381914   74005.00
13       DEM  2013   7989580.66   739.365229   90000.00
14       DEM  2014   8796737.42   840.747149  136000.00
15       DEM  2015   9327553.34   827.791386   53000.00
16       DEM  2016   9270152.99   928.221988   85950.00
17       DEM  2017   7078012.99   901.428043   45000.00
18     PCdoB  2009   2151560.31   598.986723   40000.00
19     PCdoB  2010   2807338.25   720.569366   78620.00
20     PCdoB  2011   3480287.22   600.152995   24811.70
21     PCdoB  2012   3024159.73   590.771582   25000.00
22     PCdoB  2013   3273685.92   591.345000   45000.00
23     PCdoB  2014   4005862.84   717.639348  120000.00
24     PCdoB  2015   3776044.02   789.306860   31500.00
25     PCdoB  2016   3773145.79   843.915408   50000.00
26     PCdoB  2017   3211280.75  1082.332575   35000.00
27       PDT  2009   3630838.72   645.826880   50000.00
28       PDT  2010   4903242.83   716.010927   59979.50
29       PDT  2011   4869172.19   882.576072   41750.00
..       ...   ...          ...          ...        ...
215       PV  2010   2684442.18   402.043160   36332.00
216       PV  2011   2158444.01   426.823020   30747.00
217       PV  2012   1937094.74   445.411529   27000.00
218       PV  2013   2433114.73   577.525452   38595.00
219       PV  2014   2405565.62   697.669843   27219.20
220       PV  2015   1828063.34   477.176544   28500.00
221       PV  2016   1848745.46   504.432595   51840.00
222       PV  2017   1354896.56   550.323542   15000.00
223     REDE  2011    144554.93   460.366019    7560.00
224     REDE  2012    212722.40   323.778387    9260.00
225     REDE  2013    202526.31   274.798250    6787.26
226     REDE  2014    216178.08   401.817993   10500.00
227     REDE  2015    687780.61   444.877497   47600.00
228     REDE  2016    861079.85   607.678088   28530.00
229     REDE  2017    648661.09   594.556453   19760.00
230  S.PART.  2009    351967.77   380.505697    6970.00
231  S.PART.  2010    419388.15   357.839718   21000.00
232  S.PART.  2011    387526.09   369.776803   16000.00
233  S.PART.  2012    412061.34   379.780037   11250.00
234  S.PART.  2013    292261.77   360.817000   14880.00
235  S.PART.  2014    170787.49   908.444096   71340.00
236       SD  2009   1064311.10   498.039822   15294.00
237       SD  2010   1634681.81   653.089017   37250.00
238       SD  2011   4541989.57   724.284734   44950.00
239       SD  2012   4918957.47   785.399564   42800.00
240       SD  2013   4603436.18   822.776797   56000.00
241       SD  2014   5407930.50  1048.658232  130000.00
242       SD  2015   4414932.67   915.201631  100000.00
243       SD  2016   4658844.84   840.794954   72200.00
244       SD  2017   3387509.65   843.503399   72000.00

[245 rows x 5 columns]

**Vejamos qual partido teve maior gasto em cada ano:**

In [291]:
sum_years = df_party_year.groupby("year")['sum'].max()
sum_years

year
2009    14790632.04
2010    20146005.64
2011    19003118.31
2012    19125485.67
2013    20522288.57
2014    22814538.88
2015    19121735.98
2016    20569830.85
2017    14584439.45
Name: sum, dtype: float64

In [293]:
#TODO: TEM ALGUM PROBLEMA AQUI!
sum_party_2009 = df_party_year[(df_cp_year['year'] == 2009) & (df_party_year['sum'] == sum_years[2009])]
sum_party_2010 = df_party_year[(df_cp_year['year'] == 2010) & (df_party_year['sum'] == sum_years[2010])]
sum_party_2011 = df_party_year[(df_cp_year['year'] == 2011) & (df_party_year['sum'] == sum_years[2011])]
sum_party_2012 = df_party_year[(df_cp_year['year'] == 2012) & (df_party_year['sum'] == sum_years[2012])]
sum_party_2013 = df_party_year[(df_cp_year['year'] == 2013) & (df_party_year['sum'] == sum_years[2013])]
sum_party_2014 = df_party_year[(df_cp_year['year'] == 2014) & (df_party_year['sum'] == sum_years[2014])]
sum_party_2015 = df_party_year[(df_cp_year['year'] == 2015) & (df_party_year['sum'] == sum_years[2015])]
sum_party_2016 = df_party_year[(df_cp_year['year'] == 2016) & (df_party_year['sum'] == sum_years[2016])]
sum_party_2017 = df_party_year[(df_cp_year['year'] == 2017) & (df_party_year['sum'] == sum_years[2017])]

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:10: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  # Remove the CWD from sys.path while we load stuff.

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [295]:
sum_party_2009

   party  year          sum        mean      max
54  PMDB  2009  14790632.04  561.719344  39900.0

In [305]:
sum_party_2010

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [297]:
sum_party_2011

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [298]:
sum_party_2012

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [299]:
sum_party_2013

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [300]:
sum_party_2014

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [301]:
sum_party_2015

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [302]:
sum_party_2016

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [303]:
sum_party_2017

Empty DataFrame
Columns: [party, year, sum, mean, max]
Index: []

In [ ]:
# TODO: DAQUI PRA BAIXO PRECIDA EDITAR PARA REFERENCIAR AOS PARTIDOS E NAO AOS DEPUTADOS

**Vamos descobrir agora quem são os reponsáveis pelos maiores gastos na média em cada ano:**

In [223]:
mean_max_year = df_cp_year.groupby("year")['mean'].max()

In [224]:
mean_max_year

year
2009     17700.000000
2010     33184.323333
2011     28952.000000
2012     20161.111111
2013     47200.000000
2014     62325.000000
2015    109810.000000
2016     19044.845385
2017     18960.417647
Name: mean, dtype: float64

In [225]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_max_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_max_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_max_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_max_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_max_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_max_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_max_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_max_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_max_year[2017])]

In [226]:
mean_2009

   congressperson_name  year      sum     mean      max
54         ADÃO PRETTO  2009  17700.0  17700.0  17700.0

In [227]:
mean_2010

     congressperson_name  year        sum          mean      max
4771        SILAS CÂMARA  2010  298658.91  33184.323333  93000.0

In [228]:
mean_2011

      congressperson_name  year      sum     mean      max
1676  FERNANDO DE FABINHO  2011  28952.0  28952.0  28952.0

In [229]:
mean_2012

     congressperson_name  year       sum          mean      max
5248  WELLINGTON ROBERTO  2012  362900.0  20161.111111  80000.0

In [230]:
mean_2013

        congressperson_name  year       sum     mean      max
4658  SABINO CASTELO BRANCO  2013  330400.0  47200.0  80000.0

In [231]:
mean_2014

        congressperson_name  year       sum     mean       max
4659  SABINO CASTELO BRANCO  2014  373950.0  62325.0  184500.0

In [232]:
mean_2015

     congressperson_name  year       sum      mean       max
472  ARNALDO FARIA DE SÁ  2015  219620.0  109810.0  189600.0

In [233]:
mean_2016

     congressperson_name  year        sum          mean      max
5297      WLADIMIR COSTA  2016  247582.99  19044.845385  72200.0

In [234]:
mean_2017

     congressperson_name  year       sum          mean      max
4778        SILAS CÂMARA  2017  322327.1  18960.417647  37578.6

**Agora vejamos quem são deputados com menores gastos médios:**

In [235]:
mean_min_year = df_cp_year.groupby("year")['mean'].min()

In [236]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_min_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_min_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_min_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_min_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_min_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_min_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_min_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_min_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_min_year[2017])]

In [237]:
mean_2009

     congressperson_name  year      sum       mean    max
4475           RODOVALHO  2009  7545.21  40.565645  160.0

In [238]:
mean_2010

      congressperson_name  year        sum       mean     max
2386  JORGE TADEU MUDALEN  2010  128170.67  78.152848  4900.0

In [239]:
mean_2011

    congressperson_name  year      sum      mean     max
910    CELSO RUSSOMANNO  2011  2672.02  65.17122  295.84

In [240]:
mean_2012

     congressperson_name  year    sum   mean    max
2148      HUMBERTO SOUTO  2012  250.2  62.55  103.4

In [241]:
mean_2013

     congressperson_name  year       sum       mean      max
3240    MANUEL ROSA NECA  2013  23099.08  86.838647  1545.07

In [242]:
mean_2014

      congressperson_name  year        sum       mean     max
2390  JORGE TADEU MUDALEN  2014  142048.45  86.142177  3000.0

In [243]:
mean_2015

     congressperson_name  year    sum       mean   max
3170        LÉO OLIVEIRA  2015  115.0  38.333333  50.0

In [244]:
mean_2016

     congressperson_name  year      sum       mean     max
3774    NILMÁRIO MIRANDA  2016  1370.71  91.380667  787.35

In [245]:
mean_2017

      congressperson_name  year        sum       mean      max
2393  JORGE TADEU MUDALEN  2017  144055.37  98.871222  16000.0